import networkx as nx

def create_graph():
    G = nx.Graph()
    cities = ["Київ", "Харків", "Львів", "Одеса", "Дніпро", "Запоріжжя", "Івано-Франківськ", "Чернівці", "Хмельницький"]
    roads = [("Київ", "Харків"), ("Київ", "Львів"), ("Київ", "Одеса"), ("Харків", "Дніпро"), ("Дніпро", "Запоріжжя"), ("Львів", "Івано-Франківськ"), ("Львів", "Чернівці"), ("Хмельницький", "Чернівці")]
    G.add_nodes_from(cities)
    G.add_edges_from(roads)
    return G

def create_weight_graph():
    G = nx.Graph()
    cities = ["Київ", "Харків", "Львів", "Одеса", "Дніпро", "Запоріжжя", "Івано-Франківськ", "Чернівці", "Хмельницький"]
    roads = [("Київ", "Харків", {'weight': 500}), ("Київ", "Львів", {'weight': 700}), ("Київ", "Одеса", {'weight': 450}), ("Харків", "Дніпро", {'weight': 300}), ("Дніпро", "Запоріжжя", {'weight': 200}), ("Львів", "Івано-Франківськ", {'weight': 150}), ("Львів", "Чернівці", {'weight': 250}), ("Хмельницький", "Чернівці", {'weight': 400})]
    G.add_nodes_from(cities)
    G.add_edges_from(roads)
    return G